git_workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-15 Sun 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git workflow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Git workflow
<br />
<span class="subtitle"><a href="index.html">Home</a> This is documentation on how to use Git (Gitlab) commands.</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfb4b345">1. Requirements</a></li>
<li><a href="#orgf2f1c9c">2. For setting up the repository on your local machine</a></li>
<li><a href="#org5af02a2">3. Helpful commands that you can run at any time without it messing up your files</a></li>
<li><a href="#org8ea2918">4. If now you wish to change some part of the code</a>
<ul>
<li><a href="#org0f5a082">4.1. Fetch first</a></li>
<li><a href="#org00a1d2b">4.2. Create a branch</a></li>
<li><a href="#orge90c295">4.3. Make changes</a></li>
<li><a href="#orge0ddc71">4.4. Stage and commit</a></li>
<li><a href="#org471d7ae">4.5. Push</a></li>
<li><a href="#org7b4ad72">4.6. Repeat</a></li>
<li><a href="#org89a93e4">4.7. Merge</a></li>
<li><a href="#orgab18418">4.8. Cleanup</a></li>
</ul>
</li>
</ul>
</div>
</div>
<dl class="org-dl">
<dt>Disclaimer</dt><dd>Git is a complicated tool and there might be mistakes
born due to my incorrect understanding of how git
works. Let me know if you have any questions, or if
things don't work out the way I say they would.</dd>
</dl>

<div id="outline-container-orgfb4b345" class="outline-2">
<h2 id="orgfb4b345"><span class="section-number-2">1</span> Requirements</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Terminal or Command-Prompt</li>
<li>Make sure git is installed on your computer.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2f1c9c" class="outline-2">
<h2 id="orgf2f1c9c"><span class="section-number-2">2</span> For setting up the repository on your local machine</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>Note</dt><dd><p>
Do not use <code>git clone ..</code> if you are cloning a Lean-specific
repository. Use <code>leanproject get ...</code> instead.
</p>

<p>
You need to follow these steps only the first time.
</p></dd>

<dt>(no term)</dt><dd>In your local machine, navigate to a location where you wish to
create a local copy of the repository.</dd>

<dt>(no term)</dt><dd>Run the command:
<code>git clone https://github.com/vaibhavkarve/samplerepo.git</code>.
<ul class="org-ul">
<li>This will create a copy of the remote GitLab repository (called
<code>origin</code>) into your local machine (in a folder called
<code>samplerepo</code>).</li>
<li>It will also create a hidden <code>.git</code> folder within
<code>samplerepo</code>.</li>
<li>You might have to enter your username and password here for
authorization.</li>
<li>You now have a working copy of the repository including all its
branches.</li>
<li>(To undo this step, simply delete the folder from your local
machine.)</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org5af02a2" class="outline-2">
<h2 id="org5af02a2"><span class="section-number-2">3</span> Helpful commands that you can run at any time without it messing up your files</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>git fetch</code></li>
<li><code>git branch</code></li>
<li><code>git status</code></li>
<li><code>git log --oneline --decorate --graph --all</code></li>
</ul>
</div>
</div>

<div id="outline-container-org8ea2918" class="outline-2">
<h2 id="org8ea2918"><span class="section-number-2">4</span> If now you wish to change some part of the code</h2>
<div class="outline-text-2" id="text-4">
<p>
(You need to repeat these steps every time you start working on the code.)
</p>
</div>


<div id="outline-container-org0f5a082" class="outline-3">
<h3 id="org0f5a082"><span class="section-number-3">4.1</span> Fetch first</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Always start by running the command <code>git fetch</code>.
</p>
<ul class="org-ul">
<li>This updates your local repository with any new changes that
anyone else might have pushed to GitLab since the last time you
updated the repository.</li>
<li>This command is perfectly safe to run as it does not overwrite
anything and causes no loss of data. It is just a way of syncing
your git history with that of the remote repository.</li>
<li>Run this as often as you wish, even while in the middle of
working on something. The more the better.</li>
</ul>
</div>
</div>


<div id="outline-container-org00a1d2b" class="outline-3">
<h3 id="org00a1d2b"><span class="section-number-3">4.2</span> Create a branch</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Before you start editing anything, create a new branch. This keeps
any changes you make out of the master branch till you are ready to
merge in the new changes.

<ul class="org-ul">
<li>Run the command <code>git branch dumbidea</code> to create a branch called
<code>dumbidea</code>. (Use a more descriptive name though).</li>
<li>To check if this worked, run <code>git branch</code> to create a list of
branches with an asterix next to the branch you are currently
on.</li>
<li>Note that the default branch is called <code>master</code>.</li>
<li>(You can undo this step by running <code>git branch -d dumbidea</code>. This
will delete the branch you just created.)</li>
</ul></li>

<li>Switch to the branch you created in the previous step by running
<code>git checkout dumbidea</code>.

<ul class="org-ul">
<li>(You can undo this step and switch back to master by running
<code>git checkout master</code>).</li>
<li><i>Important:</i> every time you switch branches, the files on your
local machine will change to reflect the state of the files in
that particular branch.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge90c295" class="outline-3">
<h3 id="orge90c295"><span class="section-number-3">4.3</span> Make changes</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Make the changes you wish to make to any files you want. Say you
  changed <code>A.txt</code>, <code>B.txt</code> and <code>C.txt</code>.
</p>

<ul class="org-ul">
<li>If at any point you wish to revisit or view the old file (before
your changes), you can access the old version simply by switching
back to master branch (<code>git checkout master</code>). Make sure you
switch back to your <code>dumbidea</code> branch before making more changes.</li>
<li>You can review which files you have changed by running <code>git
     status</code>.</li>
<li>You can review which changes you made in a particular file by
running say <code>git diff C.txt</code>.</li>
<li>If you are dissatisfied by the changes you made to say <code>C.txt</code>,
simply run <code>git checkout C.txt</code> to revert back to the state of the
file as it was during the previous commit. This will undo any
changes. (You cannot undo this undo-ing. So be careful. Run the
<code>git checkout C.txt</code> command only if you are sure you want to
discard any changes you made.)</li>
</ul>
</div>
</div>

<div id="outline-container-orge0ddc71" class="outline-3">
<h3 id="orge0ddc71"><span class="section-number-3">4.4</span> Stage and commit</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>Stage the changes you do wish to keep. This is done by running
<code>git add path/to/file</code>

<ul class="org-ul">
<li>Throughout the following steps, you can always run <code>git status</code>
to keep track of which files have been modified, which have been
staged, and which have been committed.</li>
<li>Staging the file is like saying "I am happy with the changes I
have made and would like to start the process of creating a
recorded history for the files at this point."</li>
<li>(You can undo this step by running <code>git reset HEAD
     path/to/file</code>.</li>
<li>If you are done editing <code>A.txt</code> but are still working on
<code>B.txt</code>, it is okay to stage only <code>A.txt</code>. Even if you edit
<code>A.txt</code> after staging, you can always re-stage it by typing <code>git
     add A.txt</code>.</li>
</ul></li>

<li>Once all files have been staged, we are ready to commit our changes
by running <code>git commit dumbidea</code>:

<ul class="org-ul">
<li>This is a local commit! This will only commit on our local
machine and will not affect what is present on GitHub. Think of
this as an extra layer of security before your <code>dumbidea</code> start
affecting everyone else.</li>
<li>You will be prompted with a message window where you should type
out your commit message in as meaningful a way as possible.</li>
<li>Check that your commit was successful by running <code>git
     status</code>. You should now see a message that says <code>your branch is
     1 commit ahead of origin/master</code>.</li>
<li>(If you wish to undo this commit, look at the next to steps
depending on whether you wish to do a soft or hard undo).</li>
</ul></li>

<li>If you decide that you committed the file too soon and would like
to undo just the commit but keep all the edits you might have made
to the file:

<ul class="org-ul">
<li>Run <code>git reset HEAD~1</code></li>
<li>This takes you back to how things were two steps ago i.e. files
are staged but not committed.</li>
<li>(To undo this undo-ing, simply repeat the previous step.)</li>
</ul></li>

<li>If you decide that the commit you made in the previous step is
complete rubbish and you want to erase all history of the edits
that were made since the commit before that, you need a hard
reset.

<ul class="org-ul">
<li>Run <code>git reset --hard HEAD~1</code></li>
<li>(This undo-ing is hard to undo, but possible. Just be careful
before doing a hard reset.)</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-org471d7ae" class="outline-3">
<h3 id="org471d7ae"><span class="section-number-3">4.5</span> Push</h3>
<div class="outline-text-3" id="text-4-5">
<p>
We are now happy with our commit and now we would like everyone to be able
   to see it on GitHub
</p>

<ul class="org-ul">
<li>If you are done with the commit and haven't had the need to undo
it, then you can run <code>git push</code> to push your changes to the
remote repository (i.e. this will update <code>origin</code>).</li>
<li>(If you wish to undo this, it is going to be difficult, but not
impossible. First, inform everyone on your team to hold off and
not work with your erroneous files. Next, start Googling for
ways to undo the <code>git push</code> commands.)</li>
</ul>
</div>
</div>

<div id="outline-container-org7b4ad72" class="outline-3">
<h3 id="org7b4ad72"><span class="section-number-3">4.6</span> Repeat</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Now you can repeat the pull-edit-add-commit-push loop as many times
  as you want in order to make further changes to your <code>dumbidea</code>
  branch.
</p>

<ul class="org-ul">
<li>Keep running <code>git fetch</code> in order to remain up-to-date with GitHub.</li>
</ul>
</div>
</div>

<div id="outline-container-org89a93e4" class="outline-3">
<h3 id="org89a93e4"><span class="section-number-3">4.7</span> Merge</h3>
<div class="outline-text-3" id="text-4-7">
<ol class="org-ol">
<li>Once you are completely confident that <code>dumbidea</code> is actually
not-so-dumb-afterall, you can decide to merge it into the <code>master</code>
branch.

<ul class="org-ul">
<li>Switch to master branch by running <code>git checkout master</code>.</li>
<li>To merge your branch with master, run <code>git merge dumbidea</code>.</li>
<li>If this process works out smoothly without displaying any
Conflict messages, then you have merged successfully. If not,
look at the next step.</li>
</ul></li>

<li>If some other user (or you yourself) have made changes to the
master branch that are not compatible with changes that you have
made to files in <code>dumbidea</code> then Git will automatically detect
this as a conflict and not allow you to merge till you resolve all
the conflicts. If this happens, do the following:

<ul class="org-ul">
<li><p>
Open the files that Git has indicated as having conflicts in
them, say <code>A.txt</code>. In <code>A.txt</code>, Git will have marked the specific
lines that are in conflict as follows:
</p>

<p>
<code>&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD:A.txt This is the line that was in the master branch.</code>
</p>

<p>
<code>This is the line that is in the dumbidea branch.</code>
</p>

<p>
<code>&gt;&gt;&gt;&gt;&gt;&gt;&gt; dumbidea:A.txt</code>
</p>

<ul class="org-ul">
<li>Replace the block of text specified above with either the
version in <code>master</code> branch, the version in <code>dumbidea</code> branch,
or a mixure of both versions.</li>
<li>Make sure to completely remove the &lt;&lt;&lt;&lt;&lt;&lt;&lt;, <code>=====</code> and &gt;&gt;&gt;&gt;&gt;&gt;&gt;
lines.</li>
<li>After resolving each section in each conflicted file, run <code>git
       add</code> on each file to mark it as resolved and to stage it.</li>
<li>Run <code>git commit</code> without any conflict messages.</li>
</ul></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgab18418" class="outline-3">
<h3 id="orgab18418"><span class="section-number-3">4.8</span> Cleanup</h3>
<div class="outline-text-3" id="text-4-8">
<ol class="org-ol">
<li>Cleaning up after you are done using your branch.

<ul class="org-ul">
<li>After you have successfully merged a branch into <code>master</code>, you
can get rid of the <code>dumbidea</code> branch by running <code>git branch -d
     dumbidea</code>.</li>
<li>This will clean up the branch history.</li>
<li>You can check that the branch has been deleted by running <code>git
     branch</code>.</li>
</ul></li>

<li>Next time you want to edit something, start again by creating a
new branch.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2020-11-15 Sun 10:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
